In [1]:

import pandas as pd
import sqlalchemy
import pprint
import psycopg2
import matplotlib.pyplot as plt
from sqlalchemy.orm import Session
from sqlalchemy import create_engine

In [2]:

engine = create_engine("postgresql+psycopg2://postgres:M&s230944@localhost/sql-challenge")

In [4]:
connection = engine.connect()
departments = pd.read_sql('select * from departments', connection)
departments.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [5]:
 #Import the Employees table
employees = pd.read_sql('select * from employees', connection)
employees

Empty DataFrame
Columns: [emp_no, emp_title_id, birth_date, first_name, last_name, sex, hire_date]
Index: []

In [6]:
#Import the Salaries table
salaries = pd.read_sql('select * from salaries', connection)
salaries.head()

Empty DataFrame
Columns: [emp_no, salary]
Index: []

In [7]:
#Import the Department Managers table
dept_manager = pd.read_sql('select * from dept_manager', connection)
dept_manager.head()

Empty DataFrame
Columns: [dept_no, emp_no]
Index: []

In [8]:
dept_manager = pd.read_sql('select * from dept_manager', connection)
dept_manager.head()

Empty DataFrame
Columns: [dept_no, emp_no]
Index: []

In [9]:
dept_emp = pd.read_sql('select * from dept_emp', connection)
dept_manager.head()

Empty DataFrame
Columns: [dept_no, emp_no]
Index: []

In [10]:
titles = pd.read_sql('select * from titles', connection)
titles.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [11]:
Emp_salary = employees.merge(salaries, on = "emp_no")
Emp_salary.head()

Empty DataFrame
Columns: [emp_title_id, birth_date, first_name, last_name, sex, hire_date, emp_no, salary]
Index: []

In [12]:
Sal_by_title = Emp_salary.merge(titles, left_on = "emp_title_id", right_on = "title_id")
Sal_by_title.head()

Empty DataFrame
Columns: [emp_title_id, birth_date, first_name, last_name, sex, hire_date, emp_no, salary, title_id, title]
Index: []

In [13]:
Sal_by_title1= Sal_by_title[['salary','title']]
Sal_by_title1

Empty DataFrame
Columns: [salary, title]
Index: []

In [ ]:
Sal_by_title1.groupby('title')['salary'].mean().round(0)

Series([], Name: salary, dtype: object)